[Message]
1=You need input %d bit of serial number.
2=The software copyright can run %d date,you need contact Han'slaser customer service for help, apply mend which matched authorization again(dongle ID=%s, verify code=%s)
3=The equipment had run a year, you need contact Han'slaser customer service for maintain to insure it run safely and normally
4=The module data download failing or the ver incorrect, please check-up the software setup whether in right
5=Check-up the dongle connect  and the driver setup whether in right when it appeared unconventionality
6=The software copryright matured at present,you need contact Han'slaser customer service for use, apply mend which matched authorization again(dongle ID=%s, verify code=%s)
7=When the type of sofeware unmatching,you need affirm the dongle suited with the software, or cotact  Han'slaser customer service for help(dongle ID=%s, type verify code=%s)
8=When the type of sofeware unmatching,you need affirm the dongle suited with the software. Check the software, Dcp1000 card & dongle update wether in need(dongle ID=%s, type verify code=%s)
9=You need contact Han'slaser customer service for help if the software, Dcp1000 card& dongle unmatching.
10=The dongle appeared unknown error
11=The dongle not found!
12=Found the dongle but illegality.
13=The module data download failing or the ver incorrect, you need check the software setup whether in right
14=Inserted dongle more than 1 pcs
15=The parameter of function nonsupport
16=The control card unknown
17=The dongle type unknown
18=The data download in Dcp1000 card failing
19=Take the function data of control card connector failing
20=The control card not exist.
21=Download the data to card failed.
//////////////////////////////////////////////////////////////////////////

24=Found unbinded card. Please finish binding first.
25=The control card not found or no binded,please use ActiveDog check first.
26=Found some cards, but no card open the multicard-running flas. Pull out the cards not needed, then reset software.
27=Current dongle had binded with other card, Are you sure repeatly bind this dongle to cards?
28=The control card has been bound to the software dongle!
29=Licence key checkout succeeded, the control card is successfully bound to the dongle!
30=Licence key checkout failed, Licence key error. 
31=When the type of sofeware mismatching,you need affirm the dongle suited with the equipment, or cotact  Han'slaser customer service for help(dongle ID=%s, type verify code=%s)
32=Are you sure to write the card number to the card?
33=The control card already has a card ID
34=The control card has written the card ID
35=Control card version low cannot write card ID
36=Custom software without License file;
37=Custom software License file decryption failed
38=The material code of customized software is inconsistent with the content of License file
39=The custom dog ID is inconsistent with the License file content
40=The custom software License file has expired


[Caption]
DlgBindCaption=Active-Bind
DlgBindDogID=dongle ID
DlgBindCardDogID=Control card_dog ID
DlgBindCardID=Card ID
DlgBindCardType=Control card type
DlgBindBtnBind=Bind
DlgBindWriteCardId=Write Card ID
DlgBindQuit=Quit

DlgEnterCodeCaption=Active Code
DlgEnterCodeTime=Release Time
DlgEnterCodeDogID=dongle ID
DlgEnterCodeCheckCode=Active Code
DlgEnterCodeCheckTimes=Active Times
DlgEnterCodeEnterCodeTitle=Please input %d bit of serie number
DlgEnterCodeBtnOK=OK
DlgEnterCodeBtnCancel=Cancel